---
title: SlabShapeCreaseArray
classe: Autodesk.Revit.DB.SlabShapeCreaseArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# SlabShapeCreaseArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `slabShapeCreaseArray.IsEmpty` | Boolean |
| `SlabShapeCrease Item { get; set; }` | `slabShapeCreaseArray.Item` | SlabShapeCrease |
| `Int32 Size { get; }` | `slabShapeCreaseArray.Size` | Int32 |
| `Void Append(SlabShapeCrease)` | `slabShapeCreaseArray.Append(item)` | Void |
| `Void Clear()` | `slabShapeCreaseArray.Clear()` | Void |
| `SlabShapeCreaseArrayIterator ForwardIterator()` | `slabShapeCreaseArray.ForwardIterator()` | SlabShapeCreaseArrayIterator |
| `IEnumerator GetEnumerator()` | `slabShapeCreaseArray.GetEnumerator()` | IEnumerator |
| `Void Insert(SlabShapeCrease, Int32)` | `slabShapeCreaseArray.Insert(item, index)` | Void |
| `SlabShapeCreaseArrayIterator ReverseIterator()` | `slabShapeCreaseArray.ReverseIterator()` | SlabShapeCreaseArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```